KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WBA50.svd
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P26WP</name>
              <description>SRAM2 1-Kbyte write protect page y write protection
These bits are set by software and cleared only by a system reset.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P27WP</name>
              <description>SRAM2 1-Kbyte write protect page y write protection
These bits are set by software and cleared only by a system reset.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P28WP</name>
              <description>SRAM2 1-Kbyte write protect page y write protection
These bits are set by software and cleared only by a system reset.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P29WP</name>
              <description>SRAM2 1-Kbyte write protect page y write protection
These bits are set by software and cleared only by a system reset.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P30WP</name>
              <description>SRAM2 1-Kbyte write protect page y write protection
These bits are set by software and cleared only by a system reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P31WP</name>
              <description>SRAM2 1-Kbyte write protect page y write protection
These bits are set by software and cleared only by a system reset.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Write protection of SRAM2 1-Kbyte write protect page y is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
